[
  {
    "id": 154,
    "package_name": "ASSISTant",
    "title": "Adaptive Subgroup Selection in Group Sequential Trials",
    "description": "Clinical trial design for subgroup selection in three-stage group\n             sequential trial as described in Lai, Lavori and Liao (2014,\n\t     <doi:10.1016/j.cct.2014.09.001>). Includes facilities for design,\n\t     exploration and analysis of such trials. An implementation of\n\t     the initial DEFUSE-3 trial is also provided as a vignette.",
    "version": "1.4.3",
    "maintainer": "Balasubramanian Narasimhan <naras@stat.Stanford.EDU>",
    "url": "https://github.com/bnaras/ASSISTant",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 368,
    "package_name": "BAR",
    "title": "Bayesian Adaptive Randomization",
    "description": "Bayesian adaptive randomization is also called outcome adaptive randomization, which is increasingly used in clinical trials.",
    "version": "0.1.1",
    "maintainer": "Chia-Wei Hsu <Chia-Wei.Hsu@stjude.org>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 401,
    "package_name": "BDP2",
    "title": "Bayesian Adaptive Designs for Phase II Trials with Binary\nEndpoint",
    "description": "Tools and workflow to choose design parameters in Bayesian adaptive single-arm phase II trial designs with binary endpoint (response, success) with possible stopping for efficacy and futility at interim analyses. Also contains routines to determine and visualize operating characteristics. See Kopp-Schneider et al. (2018) <doi:10.1002/bimj.201700209>. ",
    "version": "0.1.3",
    "maintainer": "Manuel Wiesenfarth <m.wiesenfarth@dkfz.de>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 485,
    "package_name": "BOIN",
    "title": "Bayesian Optimal INterval (BOIN) Design for Single-Agent and\nDrug- Combination Phase I Clinical Trials",
    "description": "The Bayesian optimal interval (BOIN) design is a novel phase I\n    clinical trial design for finding the maximum tolerated dose (MTD). It can be\n    used to design both single-agent and drug-combination trials. The BOIN design\n    is motivated by the top priority and concern of clinicians when testing a new\n    drug, which is to effectively treat patients and minimize the chance of exposing\n    them to subtherapeutic or overly toxic doses. The prominent advantage of the\n    BOIN design is that it achieves simplicity and superior performance at the same\n    time. The BOIN design is algorithm-based and can be implemented in a simple\n    way similar to the traditional 3+3 design. The BOIN design yields an average\n    performance that is comparable to that of the continual reassessment method\n    (CRM, one of the best model-based designs) in terms of selecting the MTD, but\n    has a substantially lower risk of assigning patients to subtherapeutic or overly\n    toxic doses. For tutorial, please check Yan et al. (2020) <doi:10.18637/jss.v094.i13>.",
    "version": "2.7.2",
    "maintainer": "Ying Yuan <yyuan@mdanderson.org>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 643,
    "package_name": "BayesianMCPMod",
    "title": "Simulate, Evaluate, and Analyze Dose Finding Trials with\nBayesian MCPMod",
    "description": "Bayesian MCPMod (Fleischer et al. (2022)\n    <doi:10.1002/pst.2193>) is an innovative method that improves the\n    traditional MCPMod by systematically incorporating historical data,\n    such as previous placebo group data. This R package offers functions\n    for simulating, analyzing, and evaluating Bayesian MCPMod trials with\n    normally distributed endpoints.  It enables the assessment of trial\n    designs incorporating historical data across various true\n    dose-response relationships and sample sizes. Robust mixture prior\n    distributions, such as those derived with the Meta-Analytic-Predictive\n    approach (Schmidli et al. (2014) <doi:10.1111/biom.12242>), can be\n    specified for each dose group.  Resulting mixture posterior\n    distributions are used in the Bayesian Multiple Comparison Procedure\n    and modeling steps. The modeling step also includes a weighted model\n    averaging approach (Pinheiro et al. (2014) <doi:10.1002/sim.6052>).\n    Estimated dose-response relationships can be bootstrapped and\n    visualized.",
    "version": "1.2.0",
    "maintainer": "Stephan Wojciekowski <stephan.wojciekowski@boehringer-ingelheim.com>",
    "url": "https://boehringer-ingelheim.github.io/BayesianMCPMod/,\nhttps://github.com/Boehringer-Ingelheim/BayesianMCPMod",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 698,
    "package_name": "BinGSD",
    "title": "Calculate Boundaries and Conditional Power for Single Arm Group\nSequential Test with Binary Endpoint",
    "description": "Consider an at-most-K-stage group sequential design with only an upper bound for the last analysis and non-binding lower bounds.With binary endpoint, two kinds of test can be applied, asymptotic test based on normal distribution and exact test based on binomial distribution. This package supports the computation of boundaries and conditional power for single-arm group sequential test with binary endpoint, via either asymptotic or exact test. The package also provides functions to obtain boundary crossing probabilities given the design.",
    "version": "1.1",
    "maintainer": "Lei Wang <slimewanglei@163.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 862,
    "package_name": "CARM",
    "title": "Covariate-Adjusted Adaptive Randomization via\nMahalanobis-Distance",
    "description": "In randomized controlled trial (RCT), balancing covariate is often one of the most important concern. CARM package provides functions to balance the covariates and generate allocation sequence by covariate-adjusted Adaptive Randomization via Mahalanobis-distance (ARM) for RCT. About what ARM is and how it works please see Y. Qin, Y. Li, W. Ma, H. Yang, and F. Hu (2024). \"Adaptive randomization via Mahalanobis distance\" Statistica Sinica. <doi:10.5705/ss.202020.0440>. In addition, the package is also suitable for the randomization process of multi-arm trials. For details, please see Yang H, Qin Y, Wang F, et al. (2023). \"Balancing covariates in multi-arm trials via adaptive randomization\" Computational Statistics & Data Analysis.<doi:10.1016/j.csda.2022.107642>.",
    "version": "2.0.0",
    "maintainer": "Fanglu Chen <chenfanglu1031@qq.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 1330,
    "package_name": "CohortPlat",
    "title": "Simulation of Cohort Platform Trials for Combination Treatments",
    "description": "A collection of functions dedicated to simulating staggered entry platform \n    trials whereby the treatment under investigation is a combination of two \n    active compounds. In order to obtain approval for this combination therapy,\n    superiority of the combination over the two active compounds and superiority\n    of the two active compounds over placebo need to be demonstrated. \n    A more detailed description of the design can be found in \n    Meyer et al. <DOI:10.1002/pst.2194> and a manual in Meyer et al. <arXiv:2202.02182>.",
    "version": "1.0.5",
    "maintainer": "Elias Laurin Meyer <elias.meyer@meduniwien.ac.at>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 1732,
    "package_name": "DTAT",
    "title": "Dose Titration Algorithm Tuning",
    "description": "Dose Titration Algorithm Tuning (DTAT) is a methodologic framework\n             allowing dose individualization to be conceived as a continuous\n             learning process that begins in early-phase clinical trials and\n             continues throughout drug development, on into clinical practice.\n             This package includes code that researchers may use to reproduce\n             or extend key results of the DTAT research programme, plus tools\n             for trialists to design and simulate a '3+3/PC' dose-finding study.\n             Please see Norris (2017a) <doi:10.12688/f1000research.10624.3> and\n             Norris (2017c) <doi:10.1101/240846>.",
    "version": "0.3-8",
    "maintainer": "David C. Norris <david@precisionmethods.guru>",
    "url": "https://precisionmethods.guru/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 1925,
    "package_name": "DoseFinding",
    "title": "Planning and Analyzing Dose Finding Experiments",
    "description": "The DoseFinding package provides functions for the design and analysis\n\t     of dose-finding experiments (with focus on pharmaceutical Phase\n\t     II clinical trials). It provides functions for: multiple contrast\n\t     tests, fitting non-linear dose-response models (using Bayesian and\n\t     non-Bayesian estimation), calculating optimal designs and an\n\t     implementation of the MCPMod methodology (Pinheiro et al. (2014)\n\t     <doi:10.1002/sim.6052>).",
    "version": "1.4-1",
    "maintainer": "Marius Thomas <marius.thomas@novartis.com>",
    "url": "https://github.com/openpharma/DoseFinding,\nhttps://openpharma.github.io/DoseFinding/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 2512,
    "package_name": "FrF2",
    "title": "Fractional Factorial Designs with 2-Level Factors",
    "description": "Regular and non-regular Fractional Factorial 2-level designs \n        can be created. Furthermore, analysis tools for Fractional\n        Factorial designs with 2-level factors are offered (main\n        effects and interaction plots for all factors simultaneously,\n        cube plot for looking at the simultaneous effects of three\n        factors, full or half normal plot, alias structure in a more\n        readable format than with the built-in function alias). ",
    "version": "2.3-4",
    "maintainer": "Ulrike Groemping <ulrike.groemping@bht-berlin.de>",
    "url": "https://prof.bht-berlin.de/groemping/DoE/,\nhttps://prof.bht-berlin.de/groemping/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 2772,
    "package_name": "GSED",
    "title": "Group Sequential Enrichment Design",
    "description": "Provides function to apply \"Group sequential enrichment design incorporating subgroup selection\" (GSED) method proposed by Magnusson and Turnbull (2013) <doi:10.1002/sim.5738>.",
    "version": "2.6",
    "maintainer": "Marie-Karelle Riviere <eldamjh@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 2978,
    "package_name": "GroupSeq",
    "title": "Group Sequential Design Probabilities - With Graphical User\nInterface",
    "description": "Computes probabilities related to group sequential designs for\n    normally distributed test statistics. Enables to derive critical\n    boundaries, power, drift, and confidence intervals of such designs.\n    Supports the alpha spending approach by Lan-DeMets (1994)\n    <doi:10.1002/sim.4780131308>.",
    "version": "1.4.3",
    "maintainer": "Roman Pahl <roman.pahl@gmail.com>",
    "url": "https://rpahl.github.io/GroupSeq/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 3045,
    "package_name": "HH",
    "title": "Statistical Analysis and Data Display: Heiberger and Holland",
    "description": "Support software for Statistical Analysis and Data Display (Second Edition, Springer, ISBN 978-1-4939-2121-8, 2015) and (First Edition, Springer, ISBN 0-387-40270-5, 2004) by Richard M. Heiberger and Burt Holland.  This contemporary presentation of statistical methods features extensive use of graphical displays for exploring data and for displaying the analysis.  The second edition includes redesigned graphics and additional chapters. The authors emphasize how to construct and interpret graphs, discuss principles of graphical design, and show how accompanying traditional tabular results are used to confirm the visual impressions derived directly from the graphs. Many of the graphical formats are novel and appear here for the first time in print.  All chapters have exercises.  All functions introduced in the book are in the package.  R code for all examples, both graphs and tables, in the book is included in the scripts directory of the package.",
    "version": "3.1-53",
    "maintainer": "Richard M. Heiberger <rmh@temple.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 3837,
    "package_name": "MABOUST",
    "title": "Multi-Armed Bayesian Ordinal Utility-Based Sequential Trial",
    "description": "Conducts and simulates the MABOUST design, including making interim decisions to stop a treatment for inferiority or stop the trial early for superiority or equivalency.",
    "version": "1.0.1",
    "maintainer": "Andrew Chapple <achapp@lsuhsc.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 3861,
    "package_name": "MAMS",
    "title": "Designing Multi-Arm Multi-Stage Studies",
    "description": "Designing multi-arm multi-stage studies with (asymptotically) normal endpoints and known variance.",
    "version": "3.0.3",
    "maintainer": "Thomas Jaki <thomas.jaki@pm.me>",
    "url": "https://tjaki.github.io/MAMS/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 3923,
    "package_name": "MCPMod",
    "title": "Design and Analysis of Dose-Finding Studies",
    "description": "Implements a methodology for the design and analysis of dose-response studies that\n             combines aspects of multiple comparison procedures  and modeling approaches\n\t     (Bretz, Pinheiro and Branson, 2005, Biometrics 61, 738-748, <doi: 10.1111/j.1541-0420.2005.00344.x>).\n             The package provides tools for the analysis of dose finding trials as well as a variety\n             of tools necessary to plan a trial to be conducted with the MCP-Mod methodology.\n             Please note: The 'MCPMod' package will not be further developed, all future development of \n             the MCP-Mod methodology will be done in the 'DoseFinding' R-package. ",
    "version": "1.0-10.1",
    "maintainer": "Bjoern Bornkamp <bornkamp@statistik.tu-dortmund.de>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 4293,
    "package_name": "Mediana",
    "title": "Clinical Trial Simulations",
    "description": "Provides a general framework for clinical trial simulations based\n    on the Clinical Scenario Evaluation (CSE) approach. The package supports a\n    broad class of data models (including clinical trials with continuous, binary,\n    survival-type and count-type endpoints as well as multivariate outcomes that are\n    based on combinations of different endpoints), analysis strategies and commonly\n    used evaluation criteria.",
    "version": "1.0.8",
    "maintainer": "Gautier Paux <gautier@paux.fr>",
    "url": "http://gpaux.github.io/Mediana/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 4376,
    "package_name": "MinEDfind",
    "title": "A Bayesian Design for Minimum Effective Dosing-Finding Trial",
    "description": "The nonparametric two-stage Bayesian adaptive design is a novel phase II clinical trial design for finding the minimum effective dose (MinED). This design is motivated by the top priority and concern of clinicians when testing a new drug, which is to effectively treat patients and minimize the chance of exposing them to subtherapeutic or overly toxic doses. It is used to design single-agent trials. ",
    "version": "0.1.3",
    "maintainer": "Chia-Wei Hsu <Chia-Wei.Hsu@stjude.org>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 4562,
    "package_name": "NCC",
    "title": "Simulation and Analysis of Platform Trials with Non-Concurrent\nControls",
    "description": "Design and analysis of flexible platform trials with non-concurrent controls. Functions for data generation, analysis, visualization and running simulation studies are provided. \n    The implemented analysis methods are described in: \n    Bofill Roig et al. (2022) <doi:10.1186/s12874-022-01683-w>, \n    Saville et al. (2022) <doi:10.1177/17407745221112013> and \n    Schmidli et al. (2014) <doi:10.1111/biom.12242>.",
    "version": "1.0",
    "maintainer": "Pavla Krotka <pavla.krotka@meduniwien.ac.at>",
    "url": "https://pavlakrotka.github.io/NCC/,\nhttps://github.com/pavlakrotka/NCC",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 4843,
    "package_name": "OncoBayes2",
    "title": "Bayesian Logistic Regression for Oncology Dose-Escalation Trials",
    "description": "Bayesian logistic regression model with optional\n  EXchangeability-NonEXchangeability parameter modelling for flexible\n  borrowing from historical or concurrent data-sources. The safety model\n  can guide dose-escalation decisions for adaptive oncology Phase I\n  dose-escalation trials which involve an arbitrary number of\n  drugs. Please refer to Neuenschwander et al. (2008)\n  <doi:10.1002/sim.3230> and Neuenschwander et al. (2016)\n  <doi:10.1080/19466315.2016.1174149> for details on the methodology.",
    "version": "0.9-4",
    "maintainer": "Sebastian Weber <sebastian.weber@novartis.com>",
    "url": "https://opensource.nibr.com/OncoBayes2/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 5077,
    "package_name": "PK",
    "title": "Basic Non-Compartmental Pharmacokinetics",
    "description": "Estimation of pharmacokinetic parameters using non-compartmental theory.",
    "version": "1.3-6",
    "maintainer": "Thomas Jaki <jaki.thomas@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 5420,
    "package_name": "PowerTOST",
    "title": "Power and Sample Size for (Bio)Equivalence Studies",
    "description": "Contains functions to calculate power and sample size for\n    various study designs used in bioequivalence studies. Use known.designs() to\n    see the designs supported. Power and sample size can be obtained based on\n    different methods, amongst them prominently the TOST procedure (two one-sided\n    t-tests). See README and NEWS for further information.",
    "version": "1.5-7",
    "maintainer": "Detlew Labes <DetlewLabes@gmx.de>",
    "url": "https://github.com/Detlew/PowerTOST",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 5421,
    "package_name": "PowerUpR",
    "title": "Power Analysis Tools for Multilevel Randomized Experiments",
    "description": "\n Includes tools to calculate statistical power, minimum detectable effect size (MDES), MDES difference (MDESD), and minimum required sample size for various multilevel randomized experiments (MRE) with continuous outcomes.\n Accomodates 14 types of MRE designs to detect main treatment effect, seven types of MRE designs to detect moderated treatment effect (2-1-1, 2-1-2, 2-2-1, 2-2-2, 3-3-1, 3-3-2, and 3-3-3 designs; <total.lev> - <trt.lev> - <mod.lev>),\n five types of MRE designs to detect mediated treatment effects (2-1-1, 2-2-1, 3-1-1, 3-2-1, and 3-3-1 designs; <trt.lev> - <med.lev> - <out.lev>), four types of partially nested (PN) design to detect main treatment effect,\n and three types of PN designs to detect mediated treatment effects (2/1, 3/1, 3/2; <trt.arm.lev> / <ctrl.arm.lev>). \n See 'PowerUp!' Excel series at <https://www.causalevaluation.org/>. ",
    "version": "1.1.0",
    "maintainer": "Metin Bulus <bulusmetin@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 5502,
    "package_name": "PwrGSD",
    "title": "Power in a Group Sequential Design",
    "description": "Tools for the evaluation of interim analysis plans for sequentially\n monitored trials on a survival endpoint; tools to construct efficacy and \n futility boundaries, for deriving power of a sequential design at a specified\n alternative, template for evaluating the performance of candidate plans at a \n set of time varying alternatives. See Izmirlian, G. (2014) <doi:10.4310/SII.2014.v7.n1.a4>.",
    "version": "2.3.8",
    "maintainer": "Grant Izmirlian <izmirlig@mail.nih.gov>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 5628,
    "package_name": "RABR",
    "title": "Simulations for Response Adaptive Block Randomization Design",
    "description": "Conduct simulations of the Response Adaptive Block Randomization (RABR) design to evaluate its type I error rate, power and operating characteristics for binary and continuous endpoints. For more details of the proposed method, please refer to Zhan et al. (2021) <doi:10.1002/sim.9104>. ",
    "version": "0.1.1",
    "maintainer": "Tianyu Zhan <tianyu.zhan.stats@gmail.com>",
    "url": "https://github.com/tian-yu-zhan/RABR",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 5646,
    "package_name": "RARfreq",
    "title": "Response Adaptive Randomization with 'Frequentist' Approaches",
    "description": "Provides functions and command-line user interface to generate allocation sequence \n             by response-adaptive randomization for clinical trials. The package currently supports \n             two families of frequentist response-adaptive randomization procedures, Doubly Adaptive \n             Biased Coin Design ('DBCD') and Sequential Estimation-adjusted Urn Model ('SEU'), for \n             binary and normal endpoints. One-sided proportion (or mean) difference and Chi-square \n             (or 'ANOVA') hypothesis testing methods are also available in the package to  facilitate \n             the inference for treatment effect. Additionally, the package provides comprehensive and \n             efficient tools to allow one to evaluate and  compare the performance of randomization \n             procedures and tests based on various criteria. For example, plots for relationship among \n             assumed treatment effects,  sample size, and power are provided. Five allocation functions \n             for 'DBCD' and six addition rule functions for 'SEU' are implemented to target allocations \n             such as 'Neyman', 'Rosenberger' Rosenberger et al. (2001) \n             <doi:10.1111/j.0006-341X.2001.00909.x> and 'Urn' allocations.",
    "version": "0.1.5",
    "maintainer": "Xiu Huang <xiu.huang@aya.yale.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 6593,
    "package_name": "SAME",
    "title": "Seamless Adaptive Multi-Arm Multi-Stage Enrichment",
    "description": "Design a Bayesian seamless multi-arm biomarker-enriched phase II/III \n             design with the survival endpoint with allowing sample size re-estimation.\n             James M S Wason, Jean E Abraham, Richard D Baird, Ioannis Gournaris, Anne-Laure Vallier, James D Brenton, Helena M Earl, Adrian P Mander (2015) <doi:10.1038/bjc.2015.278>.\n             Guosheng Yin, Nan Chen, J. Jack Lee (2018) <doi:10.1007/s12561-017-9199-7>.\n             Ying Yuan, Beibei Guo, Mark Munsell, Karen Lu, Amir Jazaeri (2016) <doi:10.1002/sim.6971>.",
    "version": "0.1.0",
    "maintainer": "Chengxue Zhong <czhong9106@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 6683,
    "package_name": "SEARS",
    "title": "Seamless Dose Escalation/Expansion with Adaptive Randomization\nScheme",
    "description": "A seamless design that combines phase I dose escalation based on toxicity with phase II dose expansion and dose comparison based on efficacy. ",
    "version": "0.1.0",
    "maintainer": "Chia-Wei Hsu <Chia-Wei.Hsu@stjude.org>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 7381,
    "package_name": "SurrogateSeq",
    "title": "Group Sequential Testing of a Treatment Effect Using a Surrogate\nMarker",
    "description": "Provides functions to implement group sequential procedures that allow for early stopping to declare efficacy using a surrogate marker and the possibility of futility stopping.   More details are available in: Parast, L. and Bartroff, J (2024) <doi:10.1093/biomtc/ujae108>. A tutorial for this package can be found at <https://laylaparast.com/home/SurrogateSeq.html>.",
    "version": "1.0",
    "maintainer": "Layla Parast <parast@austin.utexas.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 7474,
    "package_name": "TEQR",
    "title": "Target Equivalence Range Design",
    "description": "The TEQR package contains software to calculate the operating characteristics for the TEQR and the ACT designs.The TEQR (toxicity equivalence range) design is a toxicity based cumulative cohort design with added safety rules. The ACT (Activity constrained for toxicity) design  is also a cumulative cohort design with additional safety rules. The unique feature of this design is that dose is escalated based on lack of activity rather than on lack of toxicity and is de-escalated only if an unacceptable level of toxicity is experienced.",
    "version": "6.0-0",
    "maintainer": "M. Suzette Blanchard <sblanchard@coh.org>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 7635,
    "package_name": "TestDesign",
    "title": "Optimal Test Design Approach to Fixed and Adaptive Test\nConstruction",
    "description": "Uses the optimal test design approach by Birnbaum (1968, ISBN:9781593119348) and\n    van der Linden (2018) <doi:10.1201/9781315117430> to construct fixed, adaptive, and parallel tests.\n    Supports the following mixed-integer programming (MIP) solver packages: 'Rsymphony',\n    'highs', 'gurobi', 'lpSolve', and 'Rglpk'. The 'gurobi' package is not available from CRAN; see <https://www.gurobi.com/downloads/>.",
    "version": "1.7.0",
    "maintainer": "Seung W. Choi <schoi@austin.utexas.edu>",
    "url": "https://choi-phd.github.io/TestDesign/ (documentation)",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 7657,
    "package_name": "ThreeGroups",
    "title": "ML Estimator for Baseline-Placebo-Treatment (Three-Group)\nExperiments",
    "description": "Implements the Maximum Likelihood estimator for baseline, placebo, and treatment groups (three-group) experiments with non-compliance proposed by Gerber, Green, Kaplan, and Kern (2010).",
    "version": "0.21",
    "maintainer": "Holger L. Kern <hkern@fsu.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 7743,
    "package_name": "TrialSize",
    "title": "R Functions for Chapter 3,4,6,7,9,10,11,12,14,15 of Sample Size\nCalculation in Clinical Research",
    "description": "Functions and Examples in Sample Size Calculation in\n        Clinical Research.",
    "version": "1.4.1",
    "maintainer": "Vicky Qian Wu <wuqian7@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 7821,
    "package_name": "UnifiedDoseFinding",
    "title": "Dose-Finding Methods for Non-Binary Outcomes",
    "description": "In many phase I trials, the design goal is to find the dose associated with a certain target toxicity rate. In some trials, the goal can be to find the dose with a certain weighted sum of rates of various toxicity grades. For others, the goal is to find the dose with a certain mean value of a continuous response. This package provides the setup and calculations needed to run a dose-finding trial with non-binary endpoints and performs simulations to assess design’s operating characteristics under various scenarios. Three dose finding designs are included in this package: unified phase I design (Ivanova et al. (2009) <doi:10.1111/j.1541-0420.2008.01045.x>), Quasi-CRM/Robust-Quasi-CRM (Yuan et al. (2007) <doi:10.1111/j.1541-0420.2006.00666.x>, Pan et al. (2014) <doi:10.1371/journal.pone.0098147>) and generalized BOIN design (Mu et al. (2018) <doi:10.1111/rssc.12263>). The toxicity endpoints can be handled with these functions including equivalent toxicity score (ETS), total toxicity burden (TTB), general continuous toxicity endpoints, with incorporating ordinal grade toxicity information into dose-finding procedure. These functions allow customization of design characteristics to vary sample size, cohort sizes, target dose-limiting toxicity (DLT) rates, discrete or continuous toxicity score, and incorporate safety and/or stopping rules.",
    "version": "0.1.10",
    "maintainer": "Chia-Wei Hsu <Chia-Wei.Hsu@stjude.org>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 8171,
    "package_name": "accrualPlot",
    "title": "Accrual Plots and Predictions for Clinical Trials",
    "description": "Tracking accrual in clinical trials is important for trial success. \n    If accrual is too slow, the trial will take too long and be too expensive. If\n    accrual is much faster than expected, time sensitive tasks such as the writing \n    of statistical analysis plans might need to be rushed. 'accrualPlot' provides \n    functions to aid the tracking of accrual and predict when a trial will reach \n    it's intended sample size.",
    "version": "1.0.7",
    "maintainer": "Lukas Bütikofer <lukas.buetikofer@ctu.unibe.ch>",
    "url": "https://github.com/CTU-Bern/accrualPlot,\nhttps://ctu-bern.github.io/accrualPlot/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 8226,
    "package_name": "adaptIVPT",
    "title": "Adaptive Bioequivalence Design for In-Vitro Permeation Tests",
    "description": "Contains functions carrying out adaptive procedures using mixed scaling approach to establish bioequivalence for in-vitro permeation test (IVPT) data. Currently, the package provides procedures based on parallel replicate design and balanced data, according to the U.S. Food and Drug Administration's \"Draft Guidance on Acyclovir\" <https://www.accessdata.fda.gov/drugsatfda_docs/psg/Acyclovir_topical%20cream_RLD%2021478_RV12-16.pdf>. Potvin et al. (2008) <doi:10.1002/pst.294> provides the basis for our adaptive design (see Method B). For a comprehensive overview of the method, refer to Lim et al. (2023) <doi:10.1002/pst.2333>. This package reflects the views of the authors and should not be construed to represent the views or policies of the U.S. Food and Drug Administration.",
    "version": "1.1.0",
    "maintainer": "Daeyoung Lim <Daeyoung.Lim@fda.hhs.gov>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 8229,
    "package_name": "adaptTest",
    "title": "Adaptive Two-Stage Tests",
    "description": "The functions defined in this program serve for implementing adaptive\n    two-stage tests. Currently, four tests are included: Bauer and Koehne (1994),\n    Lehmacher and Wassmer (1999), Vandemeulebroecke (2006), and the horizontal conditional\n    error function. User-defined tests can also be implemented. Reference: Vandemeulebroecke,\n    An investigation of two-stage tests, Statistica Sinica 2006.",
    "version": "1.2",
    "maintainer": "Marc Vandemeulebroecke <vandemem@gmx.de>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 8233,
    "package_name": "adaptr",
    "title": "Adaptive Trial Simulator",
    "description": "Package that simulates adaptive (multi-arm, multi-stage) clinical\n    trials using adaptive stopping, adaptive arm dropping, and/or adaptive\n    randomisation. Developed as part of the INCEPT (Intensive Care Platform\n    Trial) project (<https://incept.dk/>), primarily supported by a grant\n    from Sygeforsikringen \"danmark\" (<https://www.sygeforsikring.dk/>).",
    "version": "1.4.0",
    "maintainer": "Anders Granholm <andersgran@gmail.com>",
    "url": "https://inceptdk.github.io/adaptr/,\nhttps://github.com/INCEPTdk/adaptr/, https://incept.dk/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 8268,
    "package_name": "adestr",
    "title": "Estimation in Optimal Adaptive Two-Stage Designs",
    "description": "\n  Methods to evaluate the performance characteristics of\n  various point and interval estimators for optimal adaptive two-stage designs as described\n  in Meis et al. (2024) <doi:10.1002/sim.10020>.\n  Specifically, this package is written to work with trial designs created by the 'adoptr' package\n  (Kunzmann et al. (2021) <doi:10.18637/jss.v098.i09>; Pilz et al. (2021) <doi:10.1002/sim.8953>)).\n  Apart from the a priori evaluation of performance characteristics, this package also allows for the\n  evaluation of the implemented estimators on real datasets, and it implements methods\n  to calculate p-values.",
    "version": "1.0.0",
    "maintainer": "Jan Meis <meis@imbi.uni-heidelberg.de>",
    "url": "https://jan-imbi.github.io/adestr/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 8301,
    "package_name": "adpss",
    "title": "Design and Analysis of Locally or Globally Efficient Adaptive\nDesigns",
    "description": "Provides the functions for planning and conducting a\n  clinical trial with adaptive sample size determination. Maximal statistical\n  efficiency will be exploited even when dramatic or multiple adaptations\n  are made. Such a trial consists of adaptive determination of sample size\n  at an interim analysis and implementation of frequentist statistical test at the\n  interim and final analysis with a prefixed significance level. The required\n  assumptions for the stage-wise test statistics are independent and stationary\n  increments and normality. Predetermination of adaptation rule is not required.",
    "version": "0.1.2",
    "maintainer": "Kosuke Kashiwabara <kashiwabara-tky@umin.ac.jp>",
    "url": "https://github.com/ca4wa/R-adpss",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 8731,
    "package_name": "asd",
    "title": "Simulations for Adaptive Seamless Designs",
    "description": "Package runs simulations for adaptive seamless designs with and without early outcomes \n                           for treatment selection and subpopulation type designs.",
    "version": "2.2",
    "maintainer": "Nick Parsons <nick.parsons@warwick.ac.uk>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 9116,
    "package_name": "bcrm",
    "title": "Bayesian Continual Reassessment Method for Phase I\nDose-Escalation Trials",
    "description": "Implements a wide variety of one- and two-parameter Bayesian CRM\n    designs. The program can run interactively, allowing the user to enter outcomes\n    after each cohort has been recruited, or via simulation to assess operating\n    characteristics. See Sweeting et al. (2013): <doi:10.18637/jss.v054.i13>.",
    "version": "0.5.4",
    "maintainer": "Graham Wheeler <graham.wheeler@ucl.ac.uk>",
    "url": "https://github.com/mikesweeting/bcrm",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 9459,
    "package_name": "blockrand",
    "title": "Randomization for Block Random Clinical Trials",
    "description": "Create randomizations for block random clinical trials.  Can also produce a pdf file of randomization cards.",
    "version": "1.5",
    "maintainer": "Greg Snow <538280@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 9598,
    "package_name": "brada",
    "title": "Bayesian Response-Adaptive Design Analysis",
    "description": "Provides access to a range of functions for analyzing, applying and visualizing Bayesian response-adaptive trial designs for a binary endpoint. Includes the predictive probability approach and the predictive evidence value designs for binary endpoints.",
    "version": "1.0",
    "maintainer": "Riko Kelter <riko.kelter@uni-siegen.de>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 9647,
    "package_name": "brms.mmrm",
    "title": "Bayesian MMRMs using 'brms'",
    "description": "The mixed model for repeated measures (MMRM) is a popular\n  model for longitudinal clinical trial data with continuous endpoints,\n  and 'brms' is a powerful and versatile package for fitting Bayesian\n  regression models.  The 'brms.mmrm' R package leverages 'brms' to run\n  MMRMs, and it supports a simplified interfaced to reduce difficulty\n  and align with the best practices of the life sciences.  References:\n  Bürkner (2017) <doi:10.18637/jss.v080.i01>, Mallinckrodt (2008)\n  <doi:10.1177/009286150804200402>.",
    "version": "1.1.1",
    "maintainer": "William Michael Landau <will.landau.oss@gmail.com>",
    "url": "https://openpharma.github.io/brms.mmrm/,\nhttps://github.com/openpharma/brms.mmrm",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 9849,
    "package_name": "carat",
    "title": "Covariate-Adaptive Randomization for Clinical Trials",
    "description": "Provides functions and command-line user interface to generate allocation sequence by covariate-adaptive randomization for clinical trials. The package currently supports six covariate-adaptive randomization procedures. Three hypothesis testing methods that are valid and robust under covariate-adaptive randomization are also available in the package to facilitate the inference for treatment effect under the included randomization procedures. Additionally, the package provides comprehensive and efficient tools to allow one to evaluate and compare the performance of randomization procedures and tests based on various criteria. See Ma W, Ye X, Tu F, and Hu F (2023) <doi: 10.18637/jss.v107.i02> for details. ",
    "version": "2.2.1",
    "maintainer": "Xiaoqing Ye <ye_xiaoq@163.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 9920,
    "package_name": "cats",
    "title": "Cohort Platform Trial Simulation",
    "description": "Cohort plAtform Trial Simulation whereby every cohort consists of two arms, \n             control and experimental treatment. Endpoints are co-primary binary endpoints and\n             decisions are made using either Bayesian or frequentist decision rules. \n             Realistic trial trajectories are simulated and the operating characteristics of the \n             designs are calculated.",
    "version": "1.0.2",
    "maintainer": "Elias Laurin Meyer <elias.meyer@meduniwien.ac.at>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 10329,
    "package_name": "clinicalsignificance",
    "title": "A Toolbox for Clinical Significance Analyses in Intervention\nStudies",
    "description": "A clinical significance analysis can be used to determine if an \n    intervention has a meaningful or practical effect for patients. You provide \n    a tidy data set plus a few more metrics and this package will take care of \n    it to make your results publication ready. Accompanying package to \n    Claus et al. <doi:10.18637/jss.v111.i01>.",
    "version": "3.0.0",
    "maintainer": "Benedikt Claus <benediktclaus@outlook.com>",
    "url": "https://benediktclaus.github.io/clinicalsignificance/,\nhttps://github.com/benediktclaus/clinicalsignificance",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 10333,
    "package_name": "clinsig",
    "title": "Clinical Significance Functions",
    "description": "Functions for calculating clinical significance.",
    "version": "1.2",
    "maintainer": "Jim Lemon <drjimlemon@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 10682,
    "package_name": "conf.design",
    "title": "Construction of factorial designs",
    "description": "This small library contains a series of simple tools for\n        constructing and manipulating confounded and fractional\n        factorial designs.",
    "version": "2.0.0",
    "maintainer": "Bill Venables <Bill.Venables@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 10852,
    "package_name": "cosa",
    "title": "Bound Constrained Optimal Sample Size Allocation",
    "description": "\n  Implements bound constrained optimal sample size allocation (BCOSSA) framework described in Bulus & Dong (2021) <doi:10.1080/00220973.2019.1636197> for power analysis of multilevel regression discontinuity designs (MRDDs) and multilevel randomized trials (MRTs) with continuous outcomes.\n  Minimum detectable effect size (MDES) and power computations for MRDDs allow polynomial functional form specification for the score variable (with or without interaction with the treatment indicator). See Bulus (2021) <doi:10.1080/19345747.2021.1947425>. ",
    "version": "2.1.0",
    "maintainer": "Metin Bulus <bulusmetin@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 10890,
    "package_name": "covadap",
    "title": "Implement Covariate-Adaptive Randomization",
    "description": "Implementing seven Covariate-Adaptive Randomization to assign patients to two treatments. \n    Three of these procedures can also accommodate quantitative and mixed covariates. Given a set of covariates, the user can\n    generate a single sequence of allocations or replicate the design multiple times by simulating the patients' covariate\n    profiles. At the end, an extensive assessment of the performance of the randomization procedures is provided, calculating\n    several imbalance measures. See Baldi Antognini A, Frieri R, Zagoraiou M and Novelli M (2022) <doi:10.1007/s00362-022-01381-1> for details.",
    "version": "1.0.1",
    "maintainer": "Rosamarie Frieri <rosamarie.frieri2@unibo.it>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 11125,
    "package_name": "ctrdata",
    "title": "Retrieve and Analyze Clinical Trials Data from Public Registers",
    "description": "A system for querying, retrieving and analyzing\n        protocol- and results-related information on clinical trials from\n        four public registers, the 'European Union Clinical Trials Register'\n        ('EUCTR', <https://www.clinicaltrialsregister.eu/>), \n        'ClinicalTrials.gov' (<https://clinicaltrials.gov/> and also \n        translating queries the retired classic interface), the \n        'ISRCTN' (<http://www.isrctn.com/>) and the\n        'European Union Clinical Trials Information System'\n        ('CTIS', <https://euclinicaltrials.eu/>). \n        Trial information is downloaded, converted and stored in a database \n        ('PostgreSQL', 'SQLite', 'DuckDB' or 'MongoDB'; via package 'nodbi'). \n        Protocols, statistical analysis plans, informed consent sheets and other\n        documents in registers associated with trials can also be downloaded. \n        Other functions implement trial concepts canonically across registers,\n        identify deduplicated records, easily find and extract variables \n        (fields) of interest even from complex nested data as used by the \n        registers, merge variables and update queries. \n        The package can be used for monitoring, meta- and trend-analysis of\n        the design and conduct as well as of the results of clinical trials \n        across registers.\n        See overview in Herold, R. (2025) <doi:10.1017/rsm.2025.10061>.",
    "version": "1.25.1",
    "maintainer": "Ralf Herold <ralf.herold@mailbox.org>",
    "url": "https://cran.r-project.org/package=ctrdata,\nhttps://rfhb.github.io/ctrdata/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 11634,
    "package_name": "dfcrm",
    "title": "Dose-Finding by the Continual Reassessment Method",
    "description": "Provides functions to run the CRM and\n        TITE-CRM in phase I trials and calibration tools for trial\n        planning purposes.",
    "version": "0.2-2.1",
    "maintainer": "Jimmy Duong <jkd2108@columbia.edu>",
    "url": "http://www.columbia.edu/~yc632",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 11641,
    "package_name": "dfmta",
    "title": "Phase I/II Adaptive Dose-Finding Design for MTA",
    "description": "Phase I/II adaptive dose-finding design for single-agent\n   Molecularly Targeted Agent (MTA), according to the paper \"Phase\n   I/II Dose-Finding Design for Molecularly Targeted Agent: Plateau\n   Determination using Adaptive Randomization\", Riviere Marie-Karelle et\n   al. (2016) <doi:10.1177/0962280216631763>.",
    "version": "1.7-6",
    "maintainer": "Jacques-Henri Jourdan <jacques-henri.jourdan@cnrs.fr>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 12613,
    "package_name": "esDesign",
    "title": "Adaptive Enrichment Designs with Sample Size Re-Estimation",
    "description": "Software of 'esDesign' is developed to implement the adaptive \n    enrichment designs with sample size re-estimation presented in \n    Lin et al. (2021) <doi: 10.1016/j.cct.2020.106216>. In details, \n    three-proposed trial designs are provided, including the AED1-SSR (or ES1-SSR),\n    AED2-SSR (or ES2-SSR) and AED3-SSR (or ES3-SSR). In addition, this package \n    also contains several widely used adaptive designs, such as the Marker \n    Sequential Test (MaST) design proposed Freidlin et al. \n    (2014) <doi:10.1177/1740774513503739>, the adaptive enrichment designs \n    without early stopping (AED or ES), the sample size re-estimation \n    procedure (SSR) based on the conditional power proposed by \n    Proschan and Hunsberger (1995), and some useful functions. \n    In details, we can calculate the futility and/or efficacy stopping \n    boundaries, the sample size required, calibrate the value of the threshold \n    of the difference between subgroup-specific test statistics, conduct the \n    simulation studies in AED, SSR, AED1-SSR, AED2-SSR and AED3-SSR.",
    "version": "1.0.3",
    "maintainer": "Zhao Yang <yangz98@connect.hku.hk>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 12618,
    "package_name": "escalation",
    "title": "A Modular Approach to Dose-Finding Clinical Trials",
    "description": "Methods for working with dose-finding clinical trials. We provide \n    implementations of many dose-finding clinical trial designs, including the \n    continual reassessment method (CRM) by O'Quigley et al. (1990) \n    <doi:10.2307/2531628>, the toxicity probability interval (TPI) design by Ji\n    et al. (2007) <doi:10.1177/1740774507079442>, the modified TPI (mTPI) design\n    by Ji et al. (2010) <doi:10.1177/1740774510382799>, the Bayesian optimal \n    interval design (BOIN) by Liu & Yuan (2015) <doi:10.1111/rssc.12089>, EffTox\n    by Thall & Cook (2004) <doi:10.1111/j.0006-341X.2004.00218.x>; the design of\n    Wages & Tait (2015) <doi:10.1080/10543406.2014.920873>, and the 3+3 \n    described by Korn et al. (1994) <doi:10.1002/sim.4780131802>. All designs\n    are implemented with a common interface. We also offer optional additional \n    classes to tailor the behaviour of all designs, including avoiding skipping \n    doses, stopping after n patients have been treated at the recommended dose,  \n    stopping when a toxicity condition is met, or demanding that n patients are \n    treated before stopping is allowed. By daisy-chaining together these classes\n    using the pipe operator from 'magrittr', it is simple to tailor the \n    behaviour of a dose-finding design so it behaves how the trialist wants.\n    Having provided a flexible interface for specifying designs, we then provide\n    functions to run simulations and calculate dose-paths for future cohorts of \n    patients.",
    "version": "0.2.3",
    "maintainer": "Kristian Brock <kristian.brock@gmail.com>",
    "url": "https://brockk.github.io/escalation/,\nhttps://github.com/brockk/escalation",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 12623,
    "package_name": "eselect",
    "title": "Adaptive Clinical Trial Designs with Endpoint Selection and\nSample Size Reassessment",
    "description": "Endpoint selection and sample size reassessment for multiple binary endpoints based on blinded and/or unblinded data. Trial design that allows an adaptive modification of the primary endpoint based on blinded information obtained at an interim analysis. The decision rule chooses the endpoint with the lower estimated required sample size. Additionally, the sample size is reassessed using the estimated event probabilities and correlation between endpoints. The implemented design is proposed in Bofill Roig, M., Gómez Melis, G., Posch, M., and Koenig, F. (2022). <doi:10.48550/arXiv.2206.09639>.",
    "version": "1.1",
    "maintainer": "Marta Bofill Roig <marta.bofillroig@meduniwien.ac.at>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 12725,
    "package_name": "ewoc",
    "title": "Escalation with Overdose Control",
    "description": "An implementation of a variety of escalation with overdose control designs introduced by Babb, Rogatko and Zacks (1998) <doi:10.1002/(SICI)1097-0258(19980530)17:10%3C1103::AID-SIM793%3E3.0.CO;2-9>. It calculates the next dose as a clinical trial proceeds and performs simulations to obtain operating characteristics.",
    "version": "0.3.0",
    "maintainer": "Marcio A. Diniz <marcio.diniz@cshs.org>",
    "url": "https://github.com/dnzmarcio/ewoc/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 13657,
    "package_name": "gMCP",
    "title": "Graph Based Multiple Comparison Procedures",
    "description": "Functions and a graphical user interface for graphical described\n    multiple test procedures.",
    "version": "0.8-17",
    "maintainer": "Kornelius Rohmeyer <rohmeyer@small-projects.de>",
    "url": "https://github.com/kornl/gMCP",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14396,
    "package_name": "glmmTMB",
    "title": "Generalized Linear Mixed Models using Template Model Builder",
    "description": "Fit linear and generalized linear mixed models with various\n    extensions, including zero-inflation. The models are fitted using maximum\n    likelihood estimation via 'TMB' (Template Model Builder). Random effects are\n    assumed to be Gaussian on the scale of the linear predictor and are integrated\n    out using the Laplace approximation. Gradients are calculated using automatic\n    differentiation.",
    "version": "1.1.13",
    "maintainer": "Mollie Brooks <mollieebrooks@gmail.com>",
    "url": "https://github.com/glmmTMB/glmmTMB",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14606,
    "package_name": "graphicalMCP",
    "title": "Graphical Multiple Comparison Procedures",
    "description": "Multiple comparison procedures (MCPs) control the familywise error\n    rate in clinical trials. Graphical MCPs include many commonly used\n    procedures as special cases; see Bretz et al. (2011)\n    <doi:10.1002/bimj.201000239>, Lu (2016) <doi:10.1002/sim.6985>, and Xi et\n    al. (2017) <doi:10.1002/bimj.201600233>. This package is a low-dependency\n    implementation of graphical MCPs which allow mixed types of tests. It also\n    includes power simulations and visualization of graphical MCPs.",
    "version": "0.2.8",
    "maintainer": "Dong Xi <dong.xi1@gilead.com>",
    "url": "https://github.com/openpharma/graphicalMCP",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14680,
    "package_name": "grouprar",
    "title": "Group Response Adaptive Randomization for Clinical Trials",
    "description": "\n    Implement group response-adaptive randomization procedures, which also integrates standard non-group response-adaptive randomization methods as specialized instances. It is also uniquely capable of managing complex scenarios, including those with delayed and missing responses, thereby expanding its utility in real-world applications. This package offers 16 functions for simulating a variety of response adaptive randomization procedures. These functions are essential for guiding the selection of statistical methods in clinical trials, providing a flexible and effective approach to trial design. Some of the detailed methodologies and algorithms used in this package, please refer to the following references:\n    LJ Wei (1979) <doi:10.1214/aos/1176344614>\n    L. J. WEI and S. DURHAM (1978) <doi:10.1080/01621459.1978.10480109>\n    Durham, S. D., FlournoY, N. AND LI, W. (1998) <doi:10.2307/3315771>\n    Ivanova, A., Rosenberger, W. F., Durham, S. D. and Flournoy, N. (2000) <https://www.jstor.org/stable/25053121>\n    Bai Z D, Hu F, Shen L. (2002) <doi:10.1006/jmva.2001.1987>\n    Ivanova, A. (2003) <doi:10.1007/s001840200220>\n    Hu, F., & Zhang, L. X. (2004) <doi:10.1214/aos/1079120137>\n    Hu, F., & Rosenberger, W. F. (2006, ISBN:978-0-471-65396-7).\n    Zhang, L. X., Chan, W. S., Cheung, S. H., & Hu, F. (2007) <https://www.jstor.org/stable/26432528>\n    Zhang, L., & Rosenberger, W. F. (2006) <doi:10.1111/j.1541-0420.2005.00496.x>\n    Hu, F., Zhang, L. X., Cheung, S. H., & Chan, W. S. (2008) <doi:10.1002/cjs.5550360404>.",
    "version": "0.1.0",
    "maintainer": "Guannan Zhai <guannanzhai1996@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14698,
    "package_name": "grpseq",
    "title": "Group Sequential Analysis of Clinical Trials",
    "description": "Design of group sequential trials, including non-binding futility analysis\n  at multiple time points (Gallo, Mao, and Shih, 2014, <doi:10.1080/10543406.2014.932285>).",
    "version": "1.0",
    "maintainer": "Lu Mao <lmao@biostat.wisc.edu>",
    "url": "https://sites.google.com/view/lmaowisc/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14702,
    "package_name": "gsDesign",
    "title": "Group Sequential Design",
    "description": "Derives group sequential clinical trial designs and describes\n    their properties. Particular focus on time-to-event, binary, and\n    continuous outcomes. Largely based on methods described in\n    Jennison, Christopher and Turnbull, Bruce W., 2000,\n    \"Group Sequential Methods with Applications to Clinical Trials\"\n    ISBN: 0-8493-0316-8.",
    "version": "3.8.0",
    "maintainer": "Keaven Anderson <keaven_anderson@merck.com>",
    "url": "https://keaven.github.io/gsDesign/,\nhttps://github.com/keaven/gsDesign",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14705,
    "package_name": "gsMAMS",
    "title": "Group Sequential Designs of Multi-Arm Multi-Stage Trials",
    "description": "It provides functions to generate operating characteristics and to calculate Sequential Conditional Probability Ratio Tests(SCPRT) efficacy and futility boundary values along with sample/event size of Multi-Arm Multi-Stage(MAMS) trials for different outcomes. The package is based on Jianrong Wu, Yimei Li, Liang Zhu (2023) <doi:10.1002/sim.9682>, Jianrong Wu, Yimei Li (2023) \"Group Sequential Multi-Arm Multi-Stage Survival Trial Design with Treatment Selection\"(Manuscript accepted for publication) and Jianrong Wu, Yimei Li, Shengping Yang (2023) \"Group Sequential Multi-Arm Multi-Stage Trial Design with Ordinal Endpoints\"(In preparation).   ",
    "version": "0.7.2",
    "maintainer": "Tushar Patni <tushar.patni006@gmail.com>",
    "url": "https://github.com/Tpatni719/gsMAMS",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14712,
    "package_name": "gscounts",
    "title": "Group Sequential Designs with Negative Binomial Outcomes",
    "description": "Design and analysis of group sequential designs for negative\n    binomial outcomes, as described by T Mütze, E Glimm, H Schmidli, T Friede (2018) <doi:10.1177/0962280218773115>.",
    "version": "0.1-4",
    "maintainer": "Tobias Mütze <tobias.muetze@outlook.com>",
    "url": "https://github.com/tobiasmuetze/gscounts",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 14726,
    "package_name": "gsrsb",
    "title": "Group Sequential Refined Secondary Boundary",
    "description": "A gate-keeping procedure to test a primary and a secondary endpoint in a group sequential design with multiple interim looks. Computations related to group sequential primary and secondary boundaries. Refined secondary boundaries are calculated for a gate-keeping test on a primary and a secondary endpoint in a group sequential design with multiple interim looks. The choices include both the standard boundaries and the boundaries using error spending functions. \n    See Tamhane et al. (2018), \"A gatekeeping procedure to test a primary and a secondary endpoint in a group sequential design with multiple interim looks\", Biometrics, 74(1), 40-48. ",
    "version": "1.2.1",
    "maintainer": "Jiangtao Gou <gouRpackage@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 15240,
    "package_name": "iAdapt",
    "title": "Two-Stage Adaptive Dose-Finding Clinical Trial Design",
    "description": "Simulate and implement early phase two-stage adaptive dose-finding design for binary and quasi-continuous toxicity endpoints. See Chiuzan et al. (2018) for further reading <DOI:10.1080/19466315.2018.1462727>.",
    "version": "2.0.1",
    "maintainer": "Alyssa Vanderbeek <vanderbeekam@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 16290,
    "package_name": "ldbounds",
    "title": "Lan-DeMets Method for Group Sequential Boundaries",
    "description": "Computations related to group sequential boundaries.\n    Includes calculation of bounds using the Lan-DeMets\n    alpha spending function approach. Based on FORTRAN\n        program ld98 implemented by Reboussin, et al. (2000) <doi:10.1016/s0197-2456(00)00057-x>.",
    "version": "2.0.2",
    "maintainer": "Charlie Casper <charlie.casper@hsc.utah.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 16518,
    "package_name": "lme4",
    "title": "Linear Mixed-Effects Models using 'Eigen' and S4",
    "description": "Fit linear and generalized linear mixed-effects models.\n    The models and their components are represented using S4 classes and\n    methods.  The core computational algorithms are implemented using the\n    'Eigen' C++ library for numerical linear algebra and 'RcppEigen' \"glue\".",
    "version": "1.1-38",
    "maintainer": "Ben Bolker <bbolker+lme4@gmail.com>",
    "url": "https://github.com/lme4/lme4/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 16599,
    "package_name": "logistf",
    "title": "Firth's Bias-Reduced Logistic Regression",
    "description": "Fit a logistic regression model using Firth's bias reduction method, equivalent to penalization of the log-likelihood by the Jeffreys \n\tprior. Confidence intervals for regression coefficients can be computed by penalized profile likelihood. Firth's method was proposed as ideal\n\tsolution to the problem of separation in logistic regression, see Heinze and Schemper (2002) <doi:10.1002/sim.1047>. If needed, the bias reduction can be turned off such that ordinary\n\tmaximum likelihood logistic regression is obtained. Two new modifications of Firth's method, FLIC and FLAC, lead to unbiased predictions and are now available\n\tin the package as well, see Puhr et al (2017) <doi:10.1002/sim.7273>.",
    "version": "1.26.1",
    "maintainer": "Georg Heinze <georg.heinze@meduniwien.ac.at>",
    "url": "https://github.com/georgheinze/logistf",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 16634,
    "package_name": "longpower",
    "title": "Sample Size Calculations for Longitudinal Data",
    "description": "Compute power and sample size for linear models of longitudinal\n    data. Supported models include mixed-effects models and models fit by\n    generalized least squares and generalized estimating equations. The package\n    is described in Iddi and Donohue (2022) <DOI:10.32614/RJ-2022-022>. Relevant\n    formulas are derived by Liu and Liang (1997) <DOI:10.2307/2533554>, \n    Diggle et al (2002) <ISBN:9780199676750>, and Lu, Luo, and Chen (2008)\n    <DOI:10.2202/1557-4679.1098>.",
    "version": "1.0.27",
    "maintainer": "Michael C. Donohue <mdonohue@usc.edu>",
    "url": "https://github.com/mcdonohue/longpower",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 16682,
    "package_name": "lrstat",
    "title": "Power and Sample Size Calculation for Non-Proportional Hazards\nand Beyond",
    "description": "Performs power and sample size calculation for non-proportional hazards model using the Fleming-Harrington family of weighted log-rank tests. The sequentially calculated log-rank test score statistics are assumed to have independent increments as characterized in Anastasios A. Tsiatis (1982) <doi:10.1080/01621459.1982.10477898>. The mean and variance of log-rank test score statistics are calculated based on Kaifeng Lu (2021) <doi:10.1002/pst.2069>. The boundary crossing probabilities are calculated using the recursive integration algorithm described in Christopher Jennison and Bruce W. Turnbull (2000, ISBN:0849303168). The package can also be used for continuous, binary, and count data. For continuous data, it can handle missing data through mixed-model for repeated measures (MMRM). In crossover designs, it can estimate direct treatment effects while accounting for carryover effects. For binary data, it can design Simon's 2-stage, modified toxicity probability-2 (mTPI-2), and Bayesian optimal interval (BOIN) trials. For count data, it can design group sequential trials for negative binomial endpoints with censoring. Additionally, it facilitates group sequential equivalence trials for all supported data types. Moreover, it can design adaptive group sequential trials for changes in sample size, error spending function, number and spacing or future looks. Finally, it offers various options for adjusted p-values, including graphical and gatekeeping procedures. ",
    "version": "0.2.15",
    "maintainer": "Kaifeng Lu <kaifenglu@gmail.com>",
    "url": "https://github.com/kaifenglu/lrstat",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 17193,
    "package_name": "meta",
    "title": "General Package for Meta-Analysis",
    "description": "User-friendly general package providing standard methods for meta-analysis and supporting Schwarzer, Carpenter, and Rücker <DOI:10.1007/978-3-319-21416-0>, \"Meta-Analysis with R\" (2015):\n - common effect and random effects meta-analysis;\n - several plots (forest, funnel, Galbraith / radial, L'Abbe, Baujat, bubble);\n - three-level meta-analysis model;\n - generalised linear mixed model;\n - logistic regression with penalised likelihood for rare events;\n - Hartung-Knapp method for random effects model;\n - Kenward-Roger method for random effects model;\n - prediction interval;\n - statistical tests  for funnel plot asymmetry;\n - trim-and-fill method to evaluate bias in meta-analysis;\n - meta-regression;\n - cumulative meta-analysis and leave-one-out meta-analysis;\n - import data from 'RevMan 5';\n - produce forest plot summarising several (subgroup) meta-analyses.",
    "version": "8.2-1",
    "maintainer": "Guido Schwarzer <guido.schwarzer@uniklinik-freiburg.de>",
    "url": "https://github.com/guido-s/meta/\nhttps://link.springer.com/book/10.1007/978-3-319-21416-0",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 17205,
    "package_name": "metaLik",
    "title": "Likelihood Inference in Meta-Analysis and Meta-Regression Models",
    "description": "First- and higher-order likelihood inference in\n        meta-analysis and meta-regression models.",
    "version": "0.44.0",
    "maintainer": "Cristiano Varin <cristiano.varin@unive.it>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 17271,
    "package_name": "metasens",
    "title": "Statistical Methods for Sensitivity Analysis in Meta-Analysis",
    "description": "The following methods are implemented to evaluate how sensitive the results of a meta-analysis are to potential bias in meta-analysis and to support Schwarzer et al. (2015) <DOI:10.1007/978-3-319-21416-0>, Chapter 5 'Small-Study Effects in Meta-Analysis':\n - Copas selection model described in Copas & Shi (2001) <DOI:10.1177/096228020101000402>;\n - limit meta-analysis by Rücker et al. (2011) <DOI:10.1093/biostatistics/kxq046>;\n - upper bound for outcome reporting bias by Copas & Jackson (2004) <DOI:10.1111/j.0006-341X.2004.00161.x>;\n - imputation methods for missing binary data by Gamble & Hollis (2005) <DOI:10.1016/j.jclinepi.2004.09.013> and Higgins et al. (2008) <DOI:10.1177/1740774508091600>;\n - LFK index test and Doi plot by Furuya-Kanamori et al. (2018) <DOI:10.1097/XEB.0000000000000141>.",
    "version": "1.5-3",
    "maintainer": "Guido Schwarzer <guido.schwarzer@uniklinik-freiburg.de>",
    "url": "https://github.com/guido-s/metasens,\nhttps://link.springer.com/book/10.1007/978-3-319-21416-0",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 17379,
    "package_name": "mice",
    "title": "Multivariate Imputation by Chained Equations",
    "description": "Multiple imputation using Fully Conditional Specification (FCS)\n    implemented by the MICE algorithm as described in Van Buuren and\n    Groothuis-Oudshoorn (2011) <doi:10.18637/jss.v045.i03>. Each variable has\n    its own imputation model. Built-in imputation models are provided for\n    continuous data (predictive mean matching, normal), binary data (logistic\n    regression), unordered categorical data (polytomous logistic regression)\n    and ordered categorical data (proportional odds). MICE can also impute\n    continuous two-level data (normal model, pan, second-level variables).\n    Passive imputation can be used to maintain consistency between variables.\n    Various diagnostic plots are available to inspect the quality of the\n    imputations.",
    "version": "3.19.0",
    "maintainer": "Stef van Buuren <stef.vanbuuren@tno.nl>",
    "url": "https://github.com/amices/mice, https://amices.org/mice/,\nhttps://stefvanbuuren.name/fimd/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 17794,
    "package_name": "monitOS",
    "title": "Monitoring Overall Survival in Pivotal Trials in Indolent\nCancers",
    "description": "These guidelines are meant to provide a pragmatic, yet rigorous, help to drug developers and decision makers, since they are shaped by three fundamental ingredients: the clinically determined margin of detriment on OS that is unacceptably high (delta null); the benefit on OS that is plausible given the mechanism of action of the novel intervention (delta alt); and the quantity of information (i.e. survival events) it is feasible to accrue given the clinical and drug development setting. The proposed guidelines facilitate transparent discussions between stakeholders focusing on the risks of erroneous decisions and what might be an acceptable trade-off between power and the false positive error rate.",
    "version": "0.1.6",
    "maintainer": "Thibaud Coroller <thibaud.coroller@novartis.com>",
    "url": "https://opensource.nibr.com/monitOS/,\nhttps://github.com/Novartis/monitOS",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 18354,
    "package_name": "netmeta",
    "title": "Network Meta-Analysis using Frequentist Methods",
    "description": "A comprehensive set of functions providing frequentist methods for network meta-analysis (Balduzzi et al., 2023) <doi:10.18637/jss.v106.i02> and supporting Schwarzer et al. (2015) <doi:10.1007/978-3-319-21416-0>, Chapter 8 \"Network Meta-Analysis\":\n - frequentist network meta-analysis following Rücker (2012) <doi:10.1002/jrsm.1058>;\n - additive network meta-analysis for combinations of treatments (Rücker et al., 2020) <doi:10.1002/bimj.201800167>;\n - network meta-analysis of binary data using the Mantel-Haenszel or non-central hypergeometric distribution method (Efthimiou et al., 2019) <doi:10.1002/sim.8158>, or penalised logistic regression (Evrenoglou et al., 2022) <doi:10.1002/sim.9562>;\n - rankograms and ranking of treatments by the Surface under the cumulative ranking curve (SUCRA) (Salanti et al., 2013) <doi:10.1016/j.jclinepi.2010.03.016>;\n - ranking of treatments using P-scores (frequentist analogue of SUCRAs without resampling) according to Rücker & Schwarzer (2015) <doi:10.1186/s12874-015-0060-8>;\n - split direct and indirect evidence to check consistency (Dias et al., 2010) <doi:10.1002/sim.3767>, (Efthimiou et al., 2019) <doi:10.1002/sim.8158>;\n - league table with network meta-analysis results;\n - 'comparison-adjusted' funnel plot (Chaimani & Salanti, 2012) <doi:10.1002/jrsm.57>;\n - net heat plot and design-based decomposition of Cochran's Q according to Krahn et al. (2013) <doi:10.1186/1471-2288-13-35>;\n - measures characterizing the flow of evidence between two treatments by König et al. (2013) <doi:10.1002/sim.6001>;\n - automated drawing of network graphs described in Rücker & Schwarzer (2016) <doi:10.1002/jrsm.1143>;\n - partial order of treatment rankings ('poset') and Hasse diagram for 'poset' (Carlsen & Bruggemann, 2014) <doi:10.1002/cem.2569>; (Rücker & Schwarzer, 2017) <doi:10.1002/jrsm.1270>;\n - contribution matrix as described in Papakonstantinou et al. (2018) <doi:10.12688/f1000research.14770.3> and Davies et al. (2022) <doi:10.1002/sim.9346>;\n - network meta-regression with a single continuous or binary covariate;\n - subgroup network meta-analysis.",
    "version": "3.2-0",
    "maintainer": "Guido Schwarzer <guido.schwarzer@uniklinik-freiburg.de>",
    "url": "https://github.com/guido-s/netmeta",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 18635,
    "package_name": "nphRCT",
    "title": "Non-Proportional Hazards in Randomized Controlled Trials",
    "description": "Perform a stratified weighted log-rank test in a randomized controlled trial. Tests can be visualized as a difference in average score on the two treatment arms. These methods are described in Magirr and Burman (2018) <doi:10.48550/arXiv.1807.11097>, Magirr (2020) <doi:10.48550/arXiv.2007.04767>, and Magirr and Jimenez (2022) <doi:10.48550/arXiv.2201.10445>. ",
    "version": "0.1.1",
    "maintainer": "Dominic Magirr <d.magirr@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 18646,
    "package_name": "nppbib",
    "title": "Nonparametric Partially-Balanced Incomplete Block Design\nAnalysis",
    "description": "Implements a nonparametric statistical test for rank or score data\n from partially-balanced incomplete block-design experiments.",
    "version": "1.2-0",
    "maintainer": "David Allingham <David.Allingham@newcastle.edu.au>",
    "url": "https://github.com/dalling1",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 19871,
    "package_name": "pmvalsampsize",
    "title": "Sample Size for External Validation of a Prediction Model",
    "description": "Computes the minimum sample size required for the external validation of an existing multivariable prediction model using the criteria proposed by Archer (2020) <doi:10.1002/sim.8766> and Riley (2021) <doi:10.1002/sim.9025>.",
    "version": "0.1.0",
    "maintainer": "Joie Ensor <j.ensor@bham.ac.uk>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 19881,
    "package_name": "pocrm",
    "title": "Dose Finding in Drug Combination Phase I Trials Using PO-CRM",
    "description": "Provides functions to implement and simulate the partial order continual reassessment method (PO-CRM) of Wages, Conaway and O'Quigley (2011) <doi:10.1177/1740774511408748> for use in Phase I trials of combinations of agents. Provides a function for generating a set of initial guesses (skeleton) for the toxicity probabilities at each combination that correspond to the set of possible orderings of the toxicity probabilities specified by the user.",
    "version": "0.13",
    "maintainer": "\"Brewer, Ben (arb5mt)\" <arb5mt@virginia.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 20134,
    "package_name": "presize",
    "title": "Precision Based Sample Size Calculation",
    "description": "Bland (2009) <doi:10.1136/bmj.b3985> recommended to\n    base study sizes on the width of the confidence interval rather the power of \n    a statistical test. The goal of 'presize' is to provide functions for such \n    precision based sample size calculations. For a given sample size, the \n    functions will return the precision (width of the confidence interval), and \n    vice versa. ",
    "version": "0.3.9",
    "maintainer": "Alan G. Haynes <alan.haynes@unibe.ch>",
    "url": "https://github.com/CTU-Bern/presize,\nhttps://ctu-bern.github.io/presize/",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 20417,
    "package_name": "pwr",
    "title": "Basic Functions for Power Analysis",
    "description": "Power analysis functions along the lines of Cohen (1988).",
    "version": "1.3-0",
    "maintainer": "Helios De Rosario <helios.derosario@gmail.com>",
    "url": "https://github.com/heliosdrm/pwr",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 20878,
    "package_name": "randomizeR",
    "title": "Randomization for Clinical Trials",
    "description": "This tool enables the user to choose a randomization procedure\n    based on sound scientific criteria. It comprises the generation of\n    randomization sequences as well the assessment of randomization procedures\n    based on carefully selected criteria. Furthermore, 'randomizeR' provides a\n    function for the comparison of randomization procedures.",
    "version": "3.0.2",
    "maintainer": "Ralf-Dieter Hilgers <rhilgers@ukaachen.de>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 21315,
    "package_name": "replicateBE",
    "title": "Average Bioequivalence with Expanding Limits (ABEL)",
    "description": "Performs comparative bioavailability calculations for Average\n    Bioequivalence with Expanding Limits (ABEL). Implemented are 'Method A' /\n    'Method B' and the detection of outliers. If the design allows, assessment\n    of the empiric Type I Error and iteratively adjusting alpha to control the\n    consumer risk. Average Bioequivalence - optionally with a tighter (narrow\n    therapeutic index drugs) or wider acceptance range (South Africa: Cmax) -\n    is implemented as well.",
    "version": "1.1.3",
    "maintainer": "Helmut Schütz <helmut.schuetz@bebac.at>",
    "url": "https://github.com/Helmut01/replicateBE",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 21635,
    "package_name": "rmeta",
    "title": "Meta-Analysis",
    "description": "Functions for simple fixed and random effects\n        meta-analysis for two-sample comparisons and cumulative\n        meta-analyses. Draws standard summary plots, funnel plots, and\n        computes summaries and tests for association and heterogeneity.",
    "version": "3.0",
    "maintainer": "Thomas Lumley <t.lumley@auckland.ac.nz>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 21820,
    "package_name": "rpact",
    "title": "Confirmatory Adaptive Clinical Trial Design and Analysis",
    "description": "Design and analysis of confirmatory adaptive clinical trials with continuous, binary, and survival endpoints according to the methods described in the monograph by Wassmer and Brannath (2025) <doi:10.1007/978-3-031-89669-9>. This includes classical group sequential as well as multi-stage adaptive hypotheses tests that are based on the combination testing principle.",
    "version": "4.3.0",
    "maintainer": "Friedrich Pahlke <friedrich.pahlke@rpact.com>",
    "url": "https://www.rpact.org, https://www.rpact.com,\nhttps://docs.rpact.org, https://github.com/rpact-com/rpact,\nhttps://rpact.shinyapps.io/connect",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 22182,
    "package_name": "samplesize",
    "title": "Sample Size Calculation for Various t-Tests and Wilcoxon-Test",
    "description": "Computes sample size for Student's t-test and for the Wilcoxon-Mann-Whitney test for categorical data. The t-test function allows paired and unpaired (balanced / unbalanced) designs as well as homogeneous and heterogeneous variances. The Wilcoxon function allows for ties.",
    "version": "0.2-4",
    "maintainer": "Ralph Scherer <shearer.ra76@gmail.com>",
    "url": "https://github.com/shearer/samplesize",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 22639,
    "package_name": "seqmon",
    "title": "Group Sequential Design Class for Clinical Trials",
    "description": "S4 class object for creating and managing group sequential designs. It calculates the efficacy and futility boundaries at each look. It allows modifying the design and tracking the design update history.",
    "version": "2.5",
    "maintainer": "Hui Zheng <hzheng1@mgh.harvard.edu>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 23002,
    "package_name": "simglm",
    "title": "Simulate Models Based on the Generalized Linear Model",
    "description": "Simulates regression models,\n    including both simple regression and generalized linear mixed\n    models with up to three level of nesting. Power simulations that are\n    flexible allowing the specification of missing data, unbalanced designs,\n    and different random error distributions are built into the package.",
    "version": "0.8.9",
    "maintainer": "Brandon LeBeau <lebebr01+simglm@gmail.com>",
    "url": "https://github.com/lebebr01/simglm",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 23529,
    "package_name": "speff2trial",
    "title": "Semiparametric Efficient Estimation for a Two-Sample Treatment\nEffect",
    "description": "Performs estimation and testing of the treatment effect in a 2-group randomized clinical trial with a quantitative, dichotomous, or right-censored time-to-event endpoint. The method improves efficiency by leveraging baseline predictors of the endpoint. The inverse probability weighting technique of Robins, Rotnitzky, and Zhao (JASA, 1994) is used to provide unbiased estimation when the endpoint is missing at random.",
    "version": "1.0.5",
    "maintainer": "Michal Juraska <mjuraska@fredhutch.org>",
    "url": "https://github.com/mjuraska/speff2trial",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 23673,
    "package_name": "ssanv",
    "title": "Sample Size Adjusted for Nonadherence or Variability of Input\nParameters",
    "description": "A set of functions to calculate sample size for two-sample difference in means tests. Does adjustments for either nonadherence or variability that comes from using data to estimate parameters.",
    "version": "1.1",
    "maintainer": "Michael P. Fay <mfay@niaid.nih.gov>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  },
  {
    "id": 24226,
    "package_name": "tLagInterim",
    "title": "Interim Monitoring of Clinical Trials with Time-Lagged Outcome",
    "description": "Implements inverse and augmented inverse probability weighted \n    estimators for common treatment effect parameters at an interim analysis \n    with time-lagged outcome that may not be available for all enrolled subjects.  \n    Produces estimators, standard errors, and information that can be used to \n    compute stopping boundaries using software that assumes that the \n    estimators/test statistics have independent increments. \n    Tsiatis, A. A. and Davidian, M., (2022) <doi:10.1002/sim.9580> .",
    "version": "1.1",
    "maintainer": "Shannon T. Holloway <shannon.t.holloway@gmail.com>",
    "url": "",
    "exports": [],
    "topics": [],
    "score": "NA",
    "stars": 0
  }
]
